[
    {
        "name": "20-Minute Chicken Cutlets & Zucchini Noodles with Creamy Tomato Sauce",
        "calories": "331",
        "carbs": "8",
        "fat": "17",
        "protein": "29",
        "ingredients": "1 pound chicken cutlets. ¼ teaspoon salt, divided. ¼ teaspoon ground pepper, divided. 1 tablespoon extra-virgin olive oil. ½ cup finely chopped red onion. ½ cup dry white wine. ½ cup heavy cream. 1 medium plum tomato, chopped. 2 (10 ounce) packages zucchini noodles",
        "instructions": "Sprinkle chicken with 1/8 teaspoon each salt and pepper. Heat oil in a large skillet over medium-high heat. Add the chicken and cook, turning once, until browned and cooked through, about 6 minutes. Transfer to a plate.. Add onion to the pan. Cook, stirring, for 1 minute. Increase heat to high and add wine. Cook, scraping up any browned bits, until the liquid is mostly evaporated, about 2 minutes. Reduce heat to medium and stir in cream, any accumulated juices from the chicken and the remaining 1/8 teaspoon each salt and pepper; simmer for 2 minutes. Stir in tomatoes, then return the chicken to the pan. Turn to coat. Divide the chicken and sauce between 4 plates.. Add zucchini noodles to the skillet over medium-high heat. Cook, stirring, until softened and heated through, 2 to 3 minutes. Serve with the chicken.",
        "link": "https://www.eatingwell.com/recipe/278298/20-minute-chicken-cutlets-zucchini-noodles-with-creamy-tomato-sauce/"
    },
    {
        "name": "Shepherd's Pie with Cauliflower Topping",
        "calories": "356",
        "carbs": "18",
        "fat": "23",
        "protein": "20",
        "ingredients": "1 pound lean ground beef. 2 cups chopped onion. 2 tablespoons minced garlic. 1 (15 ounce) can no-salt-added diced tomatoes, drained. 1 tablespoon reduced-sodium Worcestershire sauce. 1 ½ teaspoons chopped fresh rosemary. 3 tablespoons chopped fresh flat-leaf parsley, divided. 1 ½ teaspoons ground pepper, divided. ¾ teaspoon salt, divided. ¼ cup unsalted beef broth. 1 tablespoon all-purpose flour or gluten-free all-purpose flour. 8 cups cauliflower florets (from 1 large head cauliflower). 2 cups water. 6 tablespoons unsalted butter. ¼ cup heavy cream",
        "instructions": "Preheat oven to 375 degrees F. Heat a 12-inch ovenproof skillet over medium-high heat. Add beef, onion and garlic; cook, stirring often to crumble, until the beef is browned and onion is tender, 8 to 10 minutes. Stir in drained tomatoes, Worcestershire, rosemary, 1 tablespoon parsley, 1 teaspoon pepper and 1/4 teaspoon salt. Whisk broth and flour in a small bowl; stir into the mixture in the skillet. Cook over medium-low heat, stirring often, until the mixture thickens, about 15 minutes.. Meanwhile, place cauliflower and water in a large saucepan; bring to a boil over high heat. Cover and reduce heat to medium-high; cook until the cauliflower is tender when pierced with a fork, about 10 minutes. Drain. Add butter, cream and the remaining 1/2 teaspoon salt; mash with a fork or potato masher until smooth (you will have about 4 cups mashed).. Carefully spoon the mashed cauliflower over the hot mixture in the skillet, gently spreading it over the top (do not mix the 2 layers together). Sprinkle with the remaining 1/2 teaspoon pepper.. Bake until the top is beginning to brown and the filling is bubbly, 22 to 25 minutes. Sprinkle with the remaining 2 tablespoons parsley before serving.",
        "link": "https://www.eatingwell.com/recipe/278004/shepherds-pie-with-cauliflower-topping/"
    },
    {
        "name": "Shrimp Cauliflower Fried Rice",
        "calories": "309",
        "carbs": "10",
        "fat": "17",
        "protein": "30",
        "ingredients": "¼ cup sesame oil, divided. 2 large eggs, lightly beaten. 3 cups riced cauliflower (see Tip). 1 pound large shrimp (31-35 count), peeled and deveined. 3 cups broccoli florets. 1 medium red bell pepper, thinly sliced (about 1 cup). 3 cloves garlic, sliced. 3 tablespoons reduced-sodium soy sauce or tamari. 2 tablespoons water. 1 tablespoon rice vinegar. ½ teaspoon ground pepper",
        "instructions": "Heat 2 teaspoons oil in a large flat-bottomed carbon-steel wok or large, heavy skillet over high heat. Add eggs and cook, without stirring, until fully cooked on one side, about 30 seconds. Flip and cook until just cooked through, about 15 seconds. Transfer to a cutting board and cut into 1/2-inch pieces.. Add 2 teaspoons oil to the pan; heat over high heat. Add cauliflower in an even layer; cook, undisturbed, until lightly browned, 3 to 4 minutes. Transfer to a plate.. Add 2 teaspoons oil to the pan; heat over high heat. Add shrimp; cook, stirring often, until just opaque, about 3 minutes. Transfer to the plate with the cauliflower.. Add the remaining 2 tablespoons oil to the pan; heat over high heat. Add broccoli, bell pepper and garlic; cook, stirring occasionally, until lightly charred, 4 to 5 minutes. Stir in soy sauce (or tamari), water, vinegar and pepper. Bring to a boil; boil for 30 seconds. Remove from the heat. Stir in the reserved eggs, cauliflower and shrimp.",
        "link": "https://www.eatingwell.com/recipe/276818/shrimp-cauliflower-fried-rice/"
    },
    {
        "name": "Spicy Noodles with Pork, Scallions & Bok Choy",
        "calories": "311",
        "carbs": "39",
        "fat": "9",
        "protein": "20",
        "ingredients": "7 ounces thin rice noodles or rice sticks. 2 tablespoons canola oil, divided. 1 head bok choy (about 1 pound), chopped, greens and whites separated. 3  scallions, sliced, greens and whites separated. 2 tablespoons minced fresh ginger. ¼ cup chili-bean sauce (see Tip) or chile-garlic sauce. 1 pound ground pork. 2 cups unsalted chicken broth. 3 tablespoons reduced-sodium tamari or soy sauce. 1 teaspoon white sugar. 1 tablespoon cornstarch. 1 tablespoon water. Crushed red pepper for garnish",
        "instructions": "Cook noodles according to package directions. Drain and rinse under cold water. Set aside.. Meanwhile, heat 1 tablespoon oil in a large flat-bottomed wok or cast-iron skillet over high heat. Add bok choy whites and cook, stirring, for 1 minute. Add bok choy greens and cook until wilted, about 1 minute more. Transfer all the bok choy to a medium bowl.. Add the remaining 1 tablespoon oil, scallion whites, ginger and chili-bean sauce (or chile-garlic sauce) to the pan. Add pork and cook, crumbling with a wooden spoon, until no longer pink, 3 to 5 minutes. Add broth, tamari (or soy sauce) and sugar. Mix cornstarch and water in a small bowl and add to the pan. Bring to a boil and cook, stirring, until slightly thickened, about 1 minute. Stir in the reserved noodles and bok choy; cook, stirring, until heated through, about 1 minute. Serve topped with scallion greens and crushed red pepper, if desired.",
        "link": "https://www.eatingwell.com/recipe/276348/spicy-noodles-with-pork-scallions-bok-choy/"
    },
    {
        "name": "Chicken Cutlets with Creamy Spinach & Roasted Red Pepper Sauce",
        "calories": "305",
        "carbs": "10",
        "fat": "14",
        "protein": "28",
        "ingredients": "1 pound chicken cutlets. ¼ teaspoon salt, divided. ¼ teaspoon ground pepper, divided. 1 tablespoon extra-virgin olive oil. 1 cup chopped baby spinach. ½ cup finely chopped red onion. ⅓ cup roasted red peppers, thinly sliced. ⅓ cup sun-dried tomato halves, thinly sliced. ½ cup dry white wine. ¾ cup sour cream",
        "instructions": "Sprinkle chicken with 1/8 teaspoon each salt and pepper. Heat oil in a large skillet over medium-high heat. Add the chicken and cook, turning once, until cooked through, 6 to 8 minutes. Transfer to a plate.. Add spinach, onion, roasted red peppers and sun-dried tomatoes to the pan. Cook, stirring, for 1 minute. Increase heat to high and add wine. Cook, scraping up any browned bits, until the liquid is mostly evaporated, about 2 minutes. Reduce heat to medium and stir in sour cream, any accumulated chicken juices and the remaining 1/8 teaspoon each salt and pepper; simmer, stirring, for 2 minutes. Return the chicken to the pan and turn to coat. Serve the chicken topped with the sauce.",
        "link": "https://www.eatingwell.com/recipe/278307/chicken-cutlets-with-creamy-spinach-roasted-red-pepper-sauce/"
    },
    {
        "name": "Instant-Pot Sausage & Peppers",
        "calories": "374",
        "carbs": "39",
        "fat": "13",
        "protein": "25",
        "ingredients": "1 tablespoon extra-virgin olive oil. 1 (12 ounce) package hot or mild Italian chicken sausage. 1 large white onion, sliced. 1 medium yellow bell pepper, sliced. 1 medium green bell pepper, sliced. 1 large garlic clove, minced. ½ teaspoon dried oregano. ¼ teaspoon crushed red pepper. 1 tablespoon no-salt-added tomato paste. ½ (15 ounce) can no-salt-added crushed tomatoes. 4  Italian sandwich rolls, split and lightly toasted. ¼ cup torn fresh basil",
        "instructions": "Select Sauté setting on a programmable pressure multicooker (such as Instant Pot; times, instructions and settings may vary according to cooker brand or model). Select Medium temperature setting; heat for 1 to 2 minutes. Add oil and sausage to the cooker. Cook until browned, turning halfway through, 4 to 5 minutes per side. Remove from the cooker and set aside. Do not wipe the cooker clean.. With the heat still on Medium, add onion, yellow pepper and green pepper; cook, stirring occasionally, until softened and starting to brown, about 5 minutes. Add garlic, oregano and crushed red pepper; cook, stirring occasionally, until fragrant, about 2 minutes. Add tomato paste, and cook, stirring constantly and scraping the bottom of the cooker to release all browned bits, for 1 minute. Stir in crushed tomatoes and return the sausages to the cooker. Press Cancel.. Cover the cooker and lock the lid in place. Turn the steam release handle to Sealing position. Select Manual/Pressure Cook setting. Select High pressure for 5 minutes. (It will take 12 to 15 minutes for the cooker to come up to pressure before cooking begins.). When the cooking is finished, carefully turn the steam release handle to Venting position and let the steam fully escape (the float valve will drop; this will take 1 to 2 minutes). Remove the lid from the cooker.. Using a slotted spoon, evenly divide the sausage, onions and peppers among rolls. Top with basil. Serve immediately.",
        "link": "https://www.eatingwell.com/recipe/280476/instant-pot-sausage-peppers/"
    },
    {
        "name": "Quinoa-Stuffed Peppers",
        "calories": "350",
        "carbs": "44",
        "fat": "13",
        "protein": "16",
        "ingredients": "6 medium red, orange and/or yellow bell peppers. 1 tablespoon extra-virgin olive oil. 1 large yellow onion, chopped (about 2 cups). 1 tablespoon minced garlic. 1 teaspoon ground cumin. ¾ teaspoon chili powder. 2 teaspoons minced chipotle chiles plus 1 Tbsp. adobo sauce from can. 2 cups cooked tri-color quinoa. 1 (15 ounce) can no-salt-added black beans, rinsed. 1 (14.5 ounce) can no-salt-added diced tomatoes. 1 cup frozen corn. ¼ teaspoon salt. 1 ½ cups shredded pepper Jack cheese",
        "instructions": "Preheat oven to 375 degrees F. Cut off stem end of each bell pepper. Chop the pepper tops to yield 1 cup. Remove and discard seeds and membranes from peppers. Bring about 1 inch of water to a boil in a large saucepan fitted with a steamer basket. Add the peppers; cover and steam until starting to soften, about 3 minutes. Remove the peppers and set aside.. Heat oil in a large skillet over medium heat. Add onion and the chopped pepper tops; cook, stirring occasionally, until the onion is translucent, about 5 minutes. Stir in garlic, cumin, chili powder, chipotles and adobo; cook, stirring constantly, until fragrant, about 1 minute. Remove from heat and add quinoa, black beans, tomatoes, corn and salt; fold until well combined.. Stand the peppers upright in an 11-by-7-inch baking dish. (Trim the bottoms, if necessary, to keep the peppers upright.) Spoon about 1 cup quinoa mixture into each pepper, packing it in tightly. Cover the stuffed peppers with foil.. Bake the peppers until warmed through, about 10 minutes. Remove the foil and sprinkle the peppers evenly with cheese. Bake, uncovered, until the cheese melts and browns slightly, 5 to 8 minutes. Let rest for 5 minutes before serving.",
        "link": "https://www.eatingwell.com/recipe/280737/vegetarian-quinoa-stuffed-peppers/"
    },
    {
        "name": "Easy Shrimp Tacos",
        "calories": "398",
        "carbs": "34",
        "fat": "16",
        "protein": "29",
        "ingredients": "2 cups diced tomatoes. 1 teaspoon lime zest (reserve before juicing limes). 5 tablespoons lime juice, divided. ¼ cup chopped fresh cilantro. ¼ cup diced red onion. 2 tablespoons minced jalapeño pepper. ⅛ teaspoon salt. 2 tablespoons tahini. ½ teaspoon honey. 1 clove garlic, minced. 2 tablespoons olive oil. 1 tablespoon ground cumin. 2 teaspoons ground coriander. ¼ teaspoon ground pepper. 1 pound large raw shrimp (21-25 count; see Tip), peeled and deveined. 8 (6 inch) flour tortillas, warmed. 1 cup thinly sliced radishes",
        "instructions": "Preheat broiler. Combine tomatoes, 2 Tbsp. lime juice, cilantro, onion, jalapeño, and salt in a medium bowl; toss to combine.. Whisk lime zest, the remaining 3 Tbsp. lime juice, tahini, honey, and garlic in a small bowl.. Combine oil, cumin, coriander, and pepper in a large bowl. Add shrimp and toss to coat. Spread the shrimp on a large rimmed baking sheet. Broil, flipping once, until the shrimp are pink and just cooked through, 4 to 6 minutes.. To assemble: Place 2 to 3 shrimp on each tortilla. Top each with about 3 Tbsp. salsa, 2 tsp. tahini sauce, and 2 Tbsp. radishes.",
        "link": "https://www.eatingwell.com/recipe/280197/easy-shrimp-tacos/"
    },
    {
        "name": "Egg Roll-Inspired Cabbage Rolls",
        "calories": "231",
        "carbs": "28",
        "fat": "5",
        "protein": "20",
        "ingredients": "1 ¼ cups water. 3 tablespoons tomato paste. 2 tablespoons rice vinegar. 2 tablespoons reduced-sodium soy sauce. 4 tablespoons hoisin sauce, divided. 2 tablespoons minced fresh ginger, divided. 4 cloves garlic, minced, divided. ½ teaspoon crushed red pepper. 2 tablespoons cornstarch. 12 large leaves savoy cabbage. 2 cups finely chopped broccoli. 1 pound lean ground pork. 1 ½ cups cooked brown rice. 1  bunch scallions, sliced. 1 teaspoon toasted sesame oil",
        "instructions": "Preheat oven to 400°F. Coat a 9-by-13-inch baking dish with cooking spray.. Whisk water, tomato paste, vinegar, soy sauce, 2 tablespoons hoisin, 1 tablespoon ginger, 2 cloves garlic and crushed red pepper in a small saucepan. Whisk in cornstarch; bring to a simmer over medium-high heat. Cook, stirring, until thickened, about 2 minutes. Remove from heat and set aside.. Meanwhile, bring a large pot of water to a boil. Add 4 cabbage leaves and cook, gently stirring, until softened, 1 to 2 minutes. Transfer to a rimmed baking sheet. Repeat with the remaining cabbage leaves. Place broccoli in a colander and pour the hot water over it. Refresh with cold water. Transfer to a large bowl. Add pork, rice, scallions, sesame oil, the remaining 2 tablespoons hoisin, 1 tablespoon ginger and 2 cloves garlic, and 3 tablespoons of the reserved sauce. Stir to combine well.. Place 1/3 cup filling over the bottom third of 1 softened cabbage leaf. Fold the bottom and sides over the filling and roll up. Place, seam-side down, in the prepared baking dish. Repeat with the remaining leaves and filling. Pour the remaining sauce over the rolls. Cover with foil and bake until an instant-read thermometer inserted into the center of a roll registers 150°F, about 40 minutes.",
        "link": "https://www.eatingwell.com/recipe/280387/egg-roll-inspired-cabbage-rolls/"
    },
    {
        "name": "Chicken & Zucchini Casserole",
        "calories": "307",
        "carbs": "11",
        "fat": "14",
        "protein": "34",
        "ingredients": "3 tablespoons butter, divided. 2 pounds boneless, skinless chicken breast, cut into 1-inch pieces. 2 large zucchini, cut into 1/2-inch pieces. 1 large red bell pepper, chopped. ⅓ cup all-purpose flour. 1 cup no-salt-added chicken broth. 1 cup whole milk. 3 ounces reduced-fat cream cheese. 1 ¼ cups shredded part-skim mozzarella cheese, divided. ¾ teaspoon ground pepper. ½ teaspoon salt",
        "instructions": "Preheat oven to 400 degrees F. Melt 1 tablespoon butter in a large skillet over medium-high heat. Add chicken to the pan; cook, stirring occasionally, until well browned, about 8 minutes. Transfer the chicken to a medium bowl. Add zucchini and bell pepper to the pan; cook, stirring occasionally, until the vegetables start to soften, about 4 minutes. Transfer the zucchini mixture to the bowl with the chicken.   Photographer: Brie Goldman, Food Stylist: Holly Dreesman, Prop Stylist: Gabriel Greco. Add the remaining 2 tablespoons butter to the pan. Stir in flour; cook, stirring constantly, until the flour starts to brown, about 1 minute. Add broth and milk; bring to a boil, whisking often. Remove from heat and add cream cheese and 3/4 cup mozzarella; stir until melted. Stir in pepper and salt. Drain liquid from the chicken and vegetable mixture; stir the chicken and vegetables into the cheese sauce. Transfer to a 2-quart baking dish. Place the dish on a foil-lined baking sheet; sprinkle the casserole with the remaining 1/2 cup cheese.   Brie Goldman. Bake until the top is browned and the edges are bubbly, 20 to 25 minutes. Let stand for 10 minutes before serving.   Photographer /Antonis Achilleos, Prop Stylist / Kay Clarke, Food Stylist / Emily Nabors Hall",
        "link": "https://www.eatingwell.com/recipe/280036/chicken-zucchini-casserole/"
    },
    {
        "name": "Grilled Flank Steak with Tomato Salad",
        "calories": "346",
        "carbs": "4",
        "fat": "25",
        "protein": "25",
        "ingredients": "1 pint grape tomatoes, halved. ½ cup chopped fresh cilantro. ⅓ cup extra-virgin olive oil. 1 small jalapeño pepper, seeded and sliced. 2 teaspoons finely chopped garlic. ½ teaspoon salt, divided. 1 1-pound flank steak. ½ teaspoon ground pepper",
        "instructions": "Preheat grill to medium-high or heat a grill pan over medium-high heat.. Combine tomatoes, cilantro, oil, jalapeño, garlic and 1/4 teaspoon salt in a medium bowl; set aside.. Season steak with the remaining 1/4 teaspoon salt and pepper. Grill until an instant-read thermometer inserted in the center reads 125 degrees F for medium-rare, 3 to 5 minutes per side.. Transfer the steak to a clean cutting board, preferably one with grooves for collecting juices, and thinly slice across the grain. Divide the slices among 4 plates. Drizzle any juices that have accumulated on the cutting board over the steak and top with the tomato salad.",
        "link": "https://www.eatingwell.com/recipe/280007/grilled-flank-steak-with-tomato-salad/"
    },
    {
        "name": "Cilantro-Lime Chicken Tacos",
        "calories": "385",
        "carbs": "23",
        "fat": "18",
        "protein": "32",
        "ingredients": "1 cup loosely packed cilantro leaves, plus 1/4 cup chopped fresh cilantro, divided. ¼ cup olive oil. ½ teaspoon lime zest (reserve before juicing limes). 3 tablespoons lime juice, divided. 2 tablespoons orange juice. 2 cloves garlic, minced. ¼ teaspoon salt plus 1/8 tsp., divided. 1 ¼ pounds thin-sliced boneless, skinless chicken cutlets. 1 cup diced tomatoes. 1 cup diced strawberries. 1 tablespoon minced jalapeño pepper. 2 cups baby spinach. 8 (6 inch) blue or yellow corn tortillas, warmed",
        "instructions": "Place 1 cup cilantro leaves, oil, 2 Tbsp. lime juice, orange juice, garlic, and 1/4 tsp. salt in a food processor or blender; process until smooth. Transfer half the mixture to a small bowl and refrigerate.. Place the remaining mixture in a sealable plastic bag and add chicken. Seal and turn to coat the chicken. Refrigerate for 30 minutes to 1 hour.. Meanwhile, combine tomatoes, strawberries, jalapeño, lime zest, and the remaining 1 Tbsp. lime juice, 1/4 cup chopped cilantro, and 1/8 tsp. salt in a medium bowl; toss well. Refrigerate until ready to serve.. Preheat grill to medium-high. Lightly oil the grill grate (see Tip). Remove the chicken from the marinade (discard the marinade). Grill the chicken until browned and cooked through, 4 to 5 minutes per side. (Alternatively, broil the chicken for 4 to 5 minutes per side.) Let the chicken rest for 5 minutes. Slice into thin strips.. To assemble: Place 1/4 cup spinach and a generous 1/3 cup chicken on each tortilla. Top each with about 1 1/2 tsp. of the reserved cilantro mixture and 1/4 cup salsa.",
        "link": "https://www.eatingwell.com/recipe/280198/cilantro-lime-chicken-tacos/"
    },
    {
        "name": "Coconut Curry Shrimp",
        "calories": "378",
        "carbs": "37",
        "fat": "10",
        "protein": "34",
        "ingredients": "2 tablespoons canola oil. 3 tablespoons green curry paste. 1 tablespoon finely chopped garlic. 1 tablespoon finely chopped fresh ginger. 1 ½ teaspoons finely chopped lemongrass. 1 (15 ounce) can light coconut milk, well shaken. 1 cup reduced-sodium vegetable broth. 1 ½ teaspoons fish sauce. 2 teaspoons cornstarch. 6 ounces snow peas, cut into 1-inch pieces. 1 cup matchstick-cut carrots. 2 pounds medium shrimp, peeled and deveined. ½ cup packed fresh Thai basil or Italian basil, thinly sliced. 3 cups hot cooked brown rice",
        "instructions": "Heat oil in a large saucepan over medium heat. Add curry paste, garlic, ginger and lemongrass; cook, stirring constantly, until the mixture is aromatic and dry, about 2 minutes. Add coconut milk and broth; stir to loosen any browned bits from the bottom of the pan. Bring to a boil over medium-high heat. Reduce heat to medium-low; simmer, undisturbed, for 5 minutes.. Stir fish sauce and cornstarch in a small bowl. Stir into the curry mixture; bring to a boil over high heat. Reduce heat to medium-low; simmer, stirring occasionally, until the sauce begins to thicken, about 5 minutes.. Add snow peas and carrots to the curry mixture; return to a boil over medium-high heat. Boil, undisturbed, until the vegetables are tender, about 2 minutes. Add shrimp; cook, stirring occasionally, until the shrimp turn pink and are cooked through, about 2 minutes. Remove from heat; stir in basil. Serve over rice.",
        "link": "https://www.eatingwell.com/recipe/279260/coconut-curry-shrimp/"
    },
    {
        "name": "Easy Sesame Chicken with Green Beans",
        "calories": "257",
        "carbs": "12",
        "fat": "13",
        "protein": "23",
        "ingredients": "4  medium bone-in chicken thighs (about 5 oz. each), skin removed. 4 teaspoons toasted sesame oil or canola oil, divided. ¾ teaspoon garlic powder, divided. ¼ teaspoon salt, divided. 12 ounces green beans, trimmed. 3 tablespoons hoisin sauce. 1 tablespoon sesame seeds, toasted (see Tip). 1 medium scallion, chopped",
        "instructions": "Preheat oven to 425 degrees F. Place chicken on a large rimmed baking sheet. Brush with 1 tsp. oil and sprinkle with 1/2 tsp. garlic powder and 1/8 tsp. salt. Roast for 15 minutes.. Meanwhile, toss green beans with the remaining 3 tsp. oil, 1/4 tsp. garlic powder, and 1/8 tsp. salt in a large bowl.. After the chicken has roasted for 15 minutes, add the beans to the baking sheet in an even layer around the chicken. Brush hoisin sauce over the chicken. Return to the oven and roast until an instant-read thermometer inserted in the thickest part of the chicken without touching the bone registers 165 degrees F and the beans are tender and beginning to brown, 10 to 15 minutes more.. Combine sesame seeds and scallion in a small bowl. Toss half of the sesame seed mixture with the beans and sprinkle the remaining sesame seed mixture over the chicken.",
        "link": "https://www.eatingwell.com/recipe/280169/easy-sesame-chicken-with-green-beans/"
    },
    {
        "name": "Pita Panzanella Salad with Meatballs",
        "calories": "380",
        "carbs": "30",
        "fat": "15",
        "protein": "34",
        "ingredients": "1 ½ pounds 93%-lean ground turkey. ½ cup panko breadcrumbs. ¼ cup grated red onion, plus 3/4 cup quartered and thinly sliced. 1  large egg, lightly beaten. 1 tablespoon minced fresh oregano plus 2 tsp., or 1 1/2 tsp. dried oregano, divided. 3 teaspoons minced garlic, divided. 2 teaspoons olive oil plus 3 Tbsp., divided. ¾ teaspoon salt. ½ teaspoon ground pepper. 3 (6 inch) whole-wheat pita breads. 3 tablespoons red-wine vinegar. 1 teaspoon honey. 1 teaspoon Dijon mustard. 1  large English cucumber, sliced. 1 ¾ cups diced plum tomatoes (3-5 tomatoes). ¾ cup sliced pitted Kalamata olives",
        "instructions": "Preheat oven to 425 degrees F. Coat a large rimmed baking sheet with cooking spray.. Mix together turkey, breadcrumbs, grated onion, egg, 1 Tbsp. fresh oregano (or 1 tsp. dried), 2 tsp. garlic, 2 tsp. oil, salt, and pepper in a large bowl just until combined. Using a tablespoon, form the mixture into about 42 meatballs, each about 1 inch in diameter. Arrange on the prepared baking sheet. Bake the meatballs until browned and an instant-read thermometer inserted in the centers registers 165 degrees F, 10 to 12 minutes.. Split pitas in half horizontally into thin rounds, then tear into half-moon shapes. Arrange on a baking sheet and bake until golden brown and crisp, 5 to 7 minutes. Let cool, then break the pitas into bite-size croutons.. Whisk vinegar, the remaining 3 Tbsp. oil, 2 tsp. fresh oregano (or 1/2 tsp. dried), 1 tsp. garlic, honey, and mustard in a large bowl. Add cucumber, tomatoes, olives, and sliced onion; toss to combine. Stir in the pita croutons. Serve the salad with the meatballs.",
        "link": "https://www.eatingwell.com/recipe/280176/pita-panzanella-salad-with-meatballs/"
    },
    {
        "name": "Baked Fish & Kale Lavash Wraps",
        "calories": "392",
        "carbs": "46",
        "fat": "10",
        "protein": "24",
        "ingredients": "5 ounces baby kale or baby spinach. 3 tablespoons coarsely chopped fresh tarragon and/or dill. 2 tablespoons finely chopped scallions. ½ teaspoon kosher salt, divided. ⅛ teaspoon plus 1/4 teaspoon ground pepper, divided. 1 pound cod, halibut or barramundi, skinned and cut into 4 portions. 4 sheets lavash. 6 teaspoons extra-virgin olive oil, divided. ¼ cup Very Versatile Roasted Red Pepper Sauce (see Associated Recipes), plus more for serving",
        "instructions": "Preheat oven to 375 degrees F. Line a baking sheet with parchment paper and coat with cooking spray. Put a kettle of water on to boil.. Put greens in a bowl. Cover with boiling water and let wilt for about 5 minutes. Drain and squeeze out excess moisture. Chop and return to the bowl. Mix in tarragon (and/or dill), scallions, 1/4 teaspoon salt and 1/8 teaspoon pepper.. Pat fish dry and season with the remaining 1/4 teaspoon each salt and pepper.. To make each wrap, place a lavash sheet on your work surface with a short side closest to you. Brush with 1 teaspoon oil and place a portion of fish about 2 inches from the bottom edge. Smear 1 tablespoon red pepper sauce on the fish and top with one-fourth of the greens. Roll up like a burrito and place seam-side down on the prepared pan. Brush the wraps with the remaining 2 teaspoons oil.. Bake until the lavash is browned and crisp, rotating the pan from back to front halfway through, 20 to 30 minutes. Serve immediately with additional sauce, if desired.",
        "link": "https://www.eatingwell.com/recipe/279805/baked-fish-kale-lavash-wraps/"
    },
    {
        "name": "Pork & Pineapple Tacos",
        "calories": "306",
        "carbs": "31",
        "fat": "5",
        "protein": "35",
        "ingredients": "1 tablespoon chili powder. 2 teaspoons smoked paprika. 1 teaspoon packed light brown sugar. ¾ teaspoon salt, divided. ½ teaspoon garlic powder. ½ teaspoon ground pepper. 1 (2 pound) pork loin roast, trimmed. ⅓ cup apple juice. ½ cup lime juice. 2 cups finely diced fresh pineapple (about 1/2 small pineapple). 1 cup finely diced seeded cucumber. ¼ cup finely diced red onion. 2 tablespoons cider vinegar. 12  6-inch corn tortillas, warmed. 2 cups shredded red cabbage",
        "instructions": "Combine chili powder, paprika, brown sugar, 1/2 tsp. salt, garlic powder, and pepper in a small bowl.. Place pork in a 5- to 6-quart slow cooker. Rub the spice mixture all over the pork. Pour apple juice around the pork. Cover and cook on Low until the pork is fork-tender, 6 to 7 hours.. Meanwhile, combine lime juice and the remaining 1/4 tsp. salt in a medium bowl. Add pineapple, cucumber, and onion; toss to combine. Refrigerate until ready to serve.. Skim off visible fat from the juices in the slow cooker. Using two forks, shred the meat. Stir in vinegar.. To assemble tacos: Place a generous 1/4 cup pulled pork on each tortilla and add a drizzle of the cooking liquid. Top with about 2 1/2 Tbsp. shredded cabbage and about 3 Tbsp. of the pineapple salsa.",
        "link": "https://www.eatingwell.com/recipe/280196/pork-pineapple-tacos/"
    },
    {
        "name": "Coconut-Curry Chicken Cutlets",
        "calories": "387",
        "carbs": "27",
        "fat": "17",
        "protein": "32",
        "ingredients": "2 tablespoons grapeseed oil, divided. 1 pound chicken cutlets. 1 (14 ounce) can light coconut milk. 1 tablespoon brown sugar. 1 tablespoon red Thai curry paste (see Tip). 1 tablespoon lime juice. 2 cups cooked quinoa. Chopped fresh cilantro for garnish",
        "instructions": "Heat 1 tablespoon oil in a large skillet over medium-high heat. Add chicken, in batches if necessary, and cook, flipping once, until browned and cooked through, 1 to 3 minutes per side. Transfer to a plate.. Remove pan from heat. Whisk the remaining 1 tablespoon oil, coconut milk, brown sugar, curry paste and lime juice in the pan. Cook over high heat, stirring occasionally, until reduced by half, 5 to 10 minutes. Serve the chicken with quinoa and the sauce, garnished with cilantro, if desired.",
        "link": "https://www.eatingwell.com/recipe/279675/coconut-curry-chicken-cutlets/"
    },
    {
        "name": "Pho-Inspired Beef Noodle Soup",
        "calories": "306",
        "carbs": "33",
        "fat": "6",
        "protein": "30",
        "ingredients": "1 teaspoon canola oil. 3 cloves garlic, minced. 1 tablespoon minced fresh ginger. 1 teaspoon ground pepper. ¼ teaspoon ground cinnamon. ¼ teaspoon ground cloves. 4 cups unsalted beef broth. 1 tablespoon fish sauce. 4 ounces pad thai rice noodles. 2 cups halved snap peas. 1 cup thinly sliced white onion. 1 pound beef sirloin, thinly sliced. 1 cup bean sprouts. ½ cup thinly sliced scallions (4 medium). ¼ cup thinly sliced fresh basil. ¼ cup thinly sliced chile peppers, such as serrano or jalapeño. Lime wedges for serving",
        "instructions": "Heat oil in a large pot over medium heat. Add garlic, ginger, pepper, cinnamon and cloves; cook for 1 minute. Stir in broth and fish sauce; bring to a boil over high heat. Reduce heat to medium and simmer, partially covered, for 15 minutes.. Meanwhile, cook noodles according to package directions. Drain and divide among 4 bowls.. Add snap peas, onion and beef to the broth. Simmer until the beef is just cooked through, about 1 minute; remove from heat.. Ladle the soup over the noodles. Divide bean sprouts, scallions, basil and chiles among the bowls. Serve with lime wedges.",
        "link": "https://www.eatingwell.com/recipe/279145/pho-inspired-beef-noodle-soup/"
    },
    {
        "name": "Spice-Seared Salmon with Greek-Style Green Beans",
        "calories": "311",
        "carbs": "16",
        "fat": "15",
        "protein": "29",
        "ingredients": "2 tablespoons olive oil, divided. 1 small yellow onion, diced. 4 cloves garlic, chopped. 1 (15 ounce) can no-salt-added diced tomatoes. 2 tablespoons chopped fresh dill, divided. ½ teaspoon salt, divided. 12 ounces green beans, stem ends trimmed (4 cups). ¼ cup lemon juice. 1 pound salmon fillet with skin, cut into 4 portions. 1 tablespoon Baharat Spice Mix (see Associated Recipes)",
        "instructions": "Preheat oven to 425 degrees F. Line a large rimmed baking sheet with parchment paper or foil; coat with cooking spray.. Heat 1 Tbsp. oil in a large saucepan over medium heat. Add onion; cook, stirring often, until translucent, 3 to 5 minutes. Stir in garlic; cook for 1 minute. Stir in tomatoes, 1 Tbsp. dill, and 1/4 tsp. salt; bring to a boil over high heat. Stir in green beans. Reduce heat to low, cover, and simmer, stirring occasionally, until the beans are tender, 10 to 15 minutes.. Meanwhile, whisk lemon juice and the remaining 1 Tbsp. oil in a shallow bowl. Dip salmon in the lemon-oil mixture to coat well. Place the salmon, skin-side down, on the prepared baking sheet. Sprinkle with spice mix and the remaining 1/4 tsp. salt. Roast the salmon until it is just opaque in the center, about 10 minutes.. Divide the green bean mixture among 4 plates, add a piece of salmon, and sprinkle with the remaining 1 Tbsp. dill.",
        "link": "https://www.eatingwell.com/recipe/279114/spice-seared-salmon-with-greek-style-green-beans/"
    },
    {
        "name": "Mushroom-Swiss Turkey Burgers",
        "calories": "332",
        "carbs": "10",
        "fat": "18",
        "protein": "34",
        "ingredients": "2 tablespoons extra-virgin olive oil. 1 clove garlic, minced. ¾ teaspoon ground pepper, divided. ½ teaspoon salt, divided. 8  portobello mushroom caps, stems and gills removed (see Tips). 1 pound lean ground turkey. 2 teaspoons gluten-free Worcestershire sauce. 1 teaspoon Dijon mustard. 4 slices Swiss cheese. 1 small tomato, thinly sliced. 3 cups baby arugula",
        "instructions": "Preheat grill to medium-high (400-450 degrees F). Combine oil, garlic and 1/4 teaspoon each pepper and salt in a small bowl. Brush portobello caps with the oil mixture; set aside to marinate at room temperature for 10 minutes.. Meanwhile, combine ground turkey, Worcestershire, mustard and the remaining 1/2 teaspoon pepper and 1/4 teaspoon salt in a medium bowl. Gently mix to incorporate. (Do not overmix.) Shape into four 3/4-inch-thick patties and set aside.. Oil the grill rack (see Tips). Place the mushrooms, cap-side down, on the oiled grill rack. Grill, covered, until just tender, about 4 minutes per side. Transfer the mushrooms to a plate; cover to keep warm. Oil the rack again; place the turkey patties on the oiled rack. Grill, covered, until the patties are lightly charred and an instant-read thermometer inserted in the center registers 165 degrees F, 4 to 5 minutes per side. Place 1 cheese slice on each patty during the last minute of cooking. Transfer the patties to a plate and let rest for 5 minutes. (If your grill is large enough, grill the portobello caps and the patties at the same time.). Place each patty on the stem side of a portobello cap; top evenly with tomato slices and arugula. Cover with the remaining portobello caps, stem-side down, and serve immediately.",
        "link": "https://www.eatingwell.com/recipe/278503/mushroom-swiss-turkey-burgers/"
    },
    {
        "name": "Air-Fryer Meatloaf",
        "calories": "255",
        "carbs": "11",
        "fat": "13",
        "protein": "24",
        "ingredients": "1 pound 90%-lean ground beef. ½ pound ground pork. 1  large egg, lightly beaten. ½ cup Italian-seasoned panko breadcrumbs. ¼ cup finely chopped yellow onion. ¼ cup chopped fresh parsley. 1 ½ tablespoons Worcestershire sauce. 2 cloves garlic, minced. ½ teaspoon kosher salt. ½ teaspoon ground pepper. 5 tablespoons ketchup, divided",
        "instructions": "Preheat air fryer to 350°F for 5 minutes. Combine ground beef, ground pork, egg, panko, onion, parsley, Worcestershire, garlic, salt, pepper and 3 tablespoons ketchup in a large bowl; mix until well combined. Divide the mixture in half and form each half into a loaf (3-by-6-by-1 1/2 inches).. Place the meatloaves in the air-fryer basket. Cook until an instant-read thermometer inserted in the center registers 155°F, about 25 minutes. Brush the meatloaves with the remaining 2 tablespoons ketchup. Continue cooking until an instant-read thermometer registers 165°F, about 3 minutes. Let the meatloaves rest for 5 minutes before slicing.",
        "link": "https://www.eatingwell.com/recipe/7965122/air-fryer-meatloaf/"
    },
    {
        "name": "Instant Pot Beef Bourguignon",
        "calories": "252",
        "carbs": "15",
        "fat": "9",
        "protein": "24",
        "ingredients": "1 ¾ pounds beef stew meat, preferably chuck, trimmed and cut into 1 1/4-inch chunks. ¾ teaspoon salt, divided. ½ teaspoon ground pepper. 8 teaspoons canola oil, divided. ⅔ cup dry red wine. 1 large onion, chopped (1 1/2 cups). 1 cup diced carrots (2 medium). 4 cloves garlic, minced. ¾ teaspoon dried thyme leaves. 1 (15 ounce) can no-salt-added diced tomatoes. 1 cup low-sodium beef broth. 1  bay leaf. 1 pound cremini or button mushrooms, quartered (5 cups). 2 cups frozen pearl onions (8 oz.). 2 tablespoons cornstarch. 2 tablespoons water. 1-2 teaspoons red-wine or cider vinegar. 2 tablespoons chopped fresh parsley for garnish",
        "instructions": "Pat beef dry; sprinkle with 1/2 tsp. salt and pepper. Heat 2 tsp. oil in a large heavy skillet over medium-high heat. Add half the beef and cook, turning occasionally, until well browned, 4 to 6 minutes. Transfer to a plate. Add another 2 tsp. oil and brown the remaining beef; transfer to the plate. Add wine, stirring to scrape up any browned bits, and cook until reduced by half, 1 to 2 minutes.. Meanwhile, heat 2 tsp. oil in a multicooker using the Saute setting. Add chopped onion and carrots; cook, stirring occasionally, until softened, 4 to 6 minutes. Add garlic and thyme; cook, stirring, until fragrant, 30 seconds to 1 minute. Add tomatoes, broth and bay leaf, along with the beef and any accumulated juices, and the reduced wine.. Lock the lid in place and twist the steam-release handle to the sealed position. Select Pressure Cook/High for 40 minutes (or follow manufacturer's directions to pressure-cook for 40 minutes). When pressure-cooking is complete, let the pressure release naturally for 15 minutes.. Meanwhile, heat the remaining 2 tsp. oil in the skillet over medium-high heat. Add mushrooms and the remaining 1/4 tsp. salt; cook, stirring occasionally, until tender and lightly browned, 8 to 10 minutes. Cook pearl onions according to package directions; drain.. Release the remaining pressure in the multicooker manually. Select the Saute setting. Stir cornstarch and water in a small bowl; add to the stew. Cook, stirring, until slightly thickened, about 2 minutes. Stir in vinegar to taste, and the mushrooms and pearl onions. Garnish with parsley, if desired.",
        "link": "https://www.eatingwell.com/recipe/276958/instant-pot-beef-bourguignon/"
    },
    {
        "name": "Coconut-Curry Cod Stew with Sweet Potato & Rice",
        "calories": "382",
        "carbs": "50",
        "fat": "11",
        "protein": "19",
        "ingredients": "2 cups water. ¾ cup long-grain brown rice. 1 tablespoon canola oil. 1 tablespoon chopped fresh ginger. 1 tablespoon chopped garlic. 1  yellow bell pepper, halved, seeded, and sliced. 1 pound sweet potatoes (about 2 small or 1 large), peeled and cut into 1 1/2-inch pieces. 1 tablespoon curry powder. ½ teaspoon salt. 1 (15 ounce) can light coconut milk. 4  cod fillets (4-5 oz. each). 3 tablespoons chopped fresh cilantro, plus more for garnish. 2 teaspoons lime juice",
        "instructions": "Combine water and rice in a medium saucepan; bring to a boil. Reduce heat, cover, and simmer until the rice is tender and most of the water has been absorbed, about 40 minutes. Drain off excess water, if necessary.. Meanwhile, heat oil in a large skillet over medium heat. Add ginger and garlic; cook, stirring, until fragrant, about 30 seconds. Add bell pepper, sweet potatoes, curry powder, and salt; stir until well coated. Add coconut milk and bring to a simmer. Cover and simmer, stirring occasionally, until the sweet potatoes are just tender when pierced with a fork, 10 to 15 minutes.. Nestle cod fillets into the pan; cover and continue cooking until the sweet potatoes are soft and the cod flakes easily when pierced with a fork, 5 to 8 minutes more.. Gently stir in cilantro and lime juice. Serve the stew over the rice. Garnish with additional cilantro, if desired.",
        "link": "https://www.eatingwell.com/recipe/276938/coconut-curry-cod-stew-with-sweet-potato-rice/"
    },
    {
        "name": "Stuffed Sweet Potatoes with Chili",
        "calories": "266",
        "carbs": "27",
        "fat": "9",
        "protein": "20",
        "ingredients": "2 small sweet potatoes (about 8 oz. each). 1 tablespoon canola oil. 8 ounces 95%-lean ground beef. 2  scallions, sliced, green and white parts separated. 2 tablespoons tomato paste. 1-2 canned chipotle peppers in adobo, chopped. 1 tablespoon paprika. ¼ teaspoon salt. 1 cup canned low-sodium kidney beans, rinsed. ½ cup water. ¼ cup shredded Mexican-blend cheese. 4 teaspoons reduced-fat sour cream for garnish",
        "instructions": "Preheat oven to 425 degrees F. Line a baking sheet with foil.. Prick sweet potatoes in several places with a fork and place on the prepared pan. Bake until tender when pierced with a knife, 40 to 45 minutes. Let cool slightly.. Meanwhile, heat oil in a large skillet over medium-high heat. Add ground beef and scallion whites. Cook, stirring and breaking up the beef with a wooden spoon, until it is no longer pink, about 4 minutes. Add tomato paste, chipotles to taste, paprika, and salt. Cook, stirring, until the tomato paste begins to brown, about 1 minute. Add beans and water; cook, stirring, until most of the liquid has evaporated, about 1 minute more. Cover and keep warm.. Slice the sweet potatoes in half lengthwise. Leaving the skins intact, carefully scoop the flesh into a medium bowl. Add 1 cup of the chili mixture and stir to combine. Fill each potato skin with the sweet potato-chili mixture (the skins will be full). Return to the baking sheet and top with remaining chili mixture and cheese.. Bake until the cheese is melted and the potatoes are heated through, 3 to 5 minutes. Top with scallion greens and garnish with sour cream, if desired.",
        "link": "https://www.eatingwell.com/recipe/276936/stuffed-sweet-potatoes-with-chili/"
    },
    {
        "name": "Greek-Inspired Burgers with Herb-Feta Sauce",
        "calories": "375",
        "carbs": "24",
        "fat": "18",
        "protein": "30",
        "ingredients": "1 cup nonfat plain Greek yogurt. ¼ cup crumbled feta cheese. 3 tablespoons chopped fresh oregano, divided. ¼ teaspoon lemon zest. 2 teaspoons lemon juice. ¾ teaspoon salt, divided. 1 small red onion. 1 pound ground lamb or ground beef. ½ teaspoon ground pepper. 2  whole-wheat pitas, halved, split and warmed. 1 cup sliced cucumber. 1  plum tomato, sliced",
        "instructions": "Preheat grill to medium-high or preheat broiler to high.. Mix yogurt, feta, 1 tablespoon oregano, lemon zest, lemon juice and 1/4 teaspoon salt in a small bowl.. Cut 1/4-inch-thick slices of onion to make 1/4 cup. Finely chop more onion to make 1/4 cup. (Reserve any remaining onion for another use.) Mix the chopped onion and meat in a large bowl with the remaining 2 tablespoons oregano and 1/2 teaspoon each salt and pepper. Form into 4 oval patties, about 4 inches by 3 inches.. Grill or broil the burgers, turning once, until an instant-read thermometer registers 160 degrees F, 4 to 6 minutes per side. Serve in pita halves, with the sauce, onion slices, cucumber and tomato.",
        "link": "https://www.eatingwell.com/recipe/276345/greek-burgers-with-herb-feta-sauce/"
    },
    {
        "name": "Sheet-Pan Chicken Fajita Bowls",
        "calories": "343",
        "carbs": "24",
        "fat": "10",
        "protein": "43",
        "ingredients": "2 teaspoons chili powder. 2 teaspoons ground cumin. ¾ teaspoon salt, divided. ½ teaspoon garlic powder. ½ teaspoon smoked paprika. ¼ teaspoon ground pepper. 2 tablespoons olive oil, divided. 1 ¼ pounds chicken tenders. 1 medium yellow onion, sliced. 1 medium red bell pepper, sliced. 1 medium green bell pepper, sliced. 4 cups chopped stemmed kale. 1 (15 ounce) can no-salt-added black beans, rinsed. ¼ cup low-fat plain Greek yogurt. 1 tablespoon lime juice. 2 teaspoons water",
        "instructions": "Place a large rimmed baking sheet in the oven; preheat to 425 degrees F.. Combine chili powder, cumin, 1/2 tsp. salt, garlic powder, paprika, and ground pepper in a large bowl. Transfer 1 tsp. of the spice mixture to a medium bowl and set aside. Whisk 1 Tbsp. oil into the remaining spice mixture in the large bowl. Add chicken, onion, and red and green bell peppers; toss to coat.. Remove the pan from the oven; coat with cooking spray. Spread the chicken mixture in an even layer on the pan. Roast for 15 minutes.. Meanwhile, combine kale and black beans with the remaining 1/4 tsp. salt and 1 Tbsp. olive oil in a large bowl; toss to coat.. Remove the pan from the oven. Stir the chicken and vegetables. Spread kale and beans evenly over the top. Roast until the chicken is cooked through and the vegetables are tender, 5 to 7 minutes more.. Meanwhile, add yogurt, lime juice, and water to the reserved spice mixture; stir to combine.. Divide the chicken and vegetable mixture among 4 bowls. Drizzle with the yogurt dressing and serve.",
        "link": "https://www.eatingwell.com/recipe/274851/sheet-pan-chicken-fajita-bowls/"
    },
    {
        "name": "Turkey & Sweet Potato Chili",
        "calories": "205",
        "carbs": "16",
        "fat": "9",
        "protein": "16",
        "ingredients": "1 tablespoon extra-virgin olive oil. 1 pound ground turkey. 1 large yellow onion, chopped. 3 cloves garlic, minced. 1 tablespoon minced seeded canned chipotle pepper in adobo sauce. 1 (28 ounce) can no-salt-added diced tomatoes. 2 medium sweet potatoes (about 5 oz. each), peeled and diced. 2 cups unsalted chicken broth. ¾ teaspoon salt. 2 tablespoons lime juice. Chopped avocado for garnish",
        "instructions": "Heat oil in a large heavy pot over medium-high heat. Add turkey; cook, stirring often to crumble, until browned, about 5 minutes. Add onion and garlic; cook, stirring often, until softened, about 5 minutes. Add chipotle; cook, stirring constantly, until fragrant, about 1 minute. Stir in tomatoes, sweet potatoes, broth and salt. Bring to a simmer over medium-high heat. Cover; reduce heat to medium and simmer until the sweet potatoes are tender, about 20 minutes.. Uncover the pot; continue simmering over medium heat, stirring occasionally, until the chili slightly thickens, about 10 minutes, or until desired consistency. Stir in lime juice.. Divide the chili evenly among 6 bowls; garnish with avocado, if desired.",
        "link": "https://www.eatingwell.com/recipe/280946/turkey-sweet-potato-chili/"
    },
    {
        "name": "Chicken Parmesan Pizza",
        "calories": "373",
        "carbs": "41",
        "fat": "13",
        "protein": "28",
        "ingredients": "1 pound whole-wheat pizza dough. 1 ½ cups shredded cooked chicken breast (8 ounces). ¾ cup pizza sauce, divided. ¼ teaspoon garlic powder. ¼ teaspoon crushed red pepper. All-purpose flour for rolling dough. 1 cup shredded low-fat mozzarella cheese or 4 ounces fresh mozzarella, torn into pieces. ½ cup grated Parmesan cheese, divided. ¼ cup thinly sliced fresh basil",
        "instructions": "Preheat oven to 475 degrees F. Coat a large rimmed baking sheet with cooking spray. Let dough stand at room temperature while you prepare the toppings.. Stir chicken, 1/4 cup pizza sauce, garlic powder and crushed red pepper together in a small bowl.. Roll the pizza dough out on a lightly floured surface to the approximate size of the baking sheet. Transfer to the prepared baking sheet. Spread the remaining 1/2 cup pizza sauce over the dough. Spread the chicken mixture over the sauce. Top with mozzarella and 1/4 cup Parmesan. Bake until browned and bubbling, 16 to 20 minutes. Sprinkle with basil and the remaining 1/4 cup Parmesan. Cut into 10 pieces.",
        "link": "https://www.eatingwell.com/recipe/263102/chicken-parmesan-pizza/"
    },
    {
        "name": "Parchment Packet Baked Tuna Steaks & Vegetables with Creamy Dijon-Turmeric Sauce",
        "calories": "312",
        "carbs": "14",
        "fat": "11",
        "protein": "36",
        "ingredients": "¼ cup mayonnaise. 1 tablespoon chopped fresh parsley. 2 teaspoons Dijon mustard. 1 teaspoon honey. ½ teaspoon ground turmeric. 2 cups thinly sliced Yukon Gold potatoes (about 1/8-inch). ½ teaspoon salt, divided. ⅛ teaspoon ground pepper, plus 1/4 teaspoon, divided. 4 cups chopped kale. 1 ¼ pounds tuna (about 1 inch thick), cut into 4 pieces",
        "instructions": "Preheat oven to 450 degrees F. Cut 4 large sheets of parchment paper, each about 16 by 12 inches (or use pre-cut parchment sheets).. Combine mayonnaise, parsley, mustard, honey and turmeric in a small bowl.. To make packets, lay the parchment sheets on a work surface with the long sides closest to you. Fold each in half (bringing the short sides together), then open. Place 1/2 cup potatoes on one side of each piece of parchment and sprinkle with 1/4 teaspoon salt and 1/8 teaspoon pepper. Top each with 1 cup of kale and a piece of tuna. Sprinkle the tuna with the remaining 1/4 teaspoon each salt and pepper. Brush with the mayonnaise mixture. Close the packets and seal the edges with small, tight folds. Place the packets on a large baking sheet.. Bake until the fish is just cooked through, 10 to 15 minutes. (Carefully open one packet to check for doneness--be cautious of the steam.) Set each packet on its own plate. Let stand for 3 minutes. Cut an X in the top of each packet with scissors and carefully fold open to serve.",
        "link": "https://www.eatingwell.com/recipe/277819/parchment-packet-baked-tuna-steaks-vegetables-with-creamy-dijon-turmeric-sauce/"
    },
    {
        "name": "Green Chicken Curry",
        "calories": "360",
        "carbs": "20",
        "fat": "20",
        "protein": "24",
        "ingredients": "2 tablespoons canola oil. 1 pound boneless, skinless chicken thighs, trimmed, cut into bite-size pieces. 1 bunch scallions, sliced. 1  medium sweet potato, cut into 1/2-inch cubes. 1 14-ounce can “lite” coconut milk. 2 tablespoons Thai green, red or yellow curry paste. 1 tablespoon fish sauce. 3 cups sliced bok choy. 1 ½ cups halved green beans, fresh or frozen (thawed). ¼ cup chopped fresh basil. 1 tablespoon lime juice",
        "instructions": "Heat oil in a large skillet over medium-high heat. Add chicken and scallions and cook, stirring, until the chicken is no longer pink, 4 to 5 minutes. Transfer to a plate with a slotted spoon.. Add sweet potato to the pan and cook, stirring, for 2 minutes. Add coconut milk, curry paste, fish sauce, bok choy and green beans; bring to a simmer. Reduce heat to medium, cover and cook, stirring once or twice, until the vegetables are tender, 5 to 7 minutes. Return the chicken and any accumulated juices to the pan and cook until heated through, about 2 minutes more. Remove from heat and stir in basil and lime juice.",
        "link": "https://www.eatingwell.com/recipe/251155/green-chicken-curry/"
    },
    {
        "name": "Slow-Cooker Braised Beef with Carrots & Turnips",
        "calories": "318",
        "carbs": "13",
        "fat": "11",
        "protein": "35",
        "ingredients": "1 tablespoon kosher salt. 2 teaspoons ground cinnamon. ½ teaspoon ground allspice. ½ teaspoon ground pepper. ¼ teaspoon ground cloves. 3-3 1/2 pounds beef chuck roast, trimmed. 2 tablespoons extra-virgin olive oil. 1 medium onion, chopped. 3 cloves garlic, sliced. 1 cup red wine. 1 (28 ounce) can whole tomatoes, preferably San Marzano. 5 medium carrots, cut into 1-inch pieces. 2 medium turnips, peeled and cut into 1/2-inch pieces. Chopped fresh basil for garnish",
        "instructions": "Combine salt, cinnamon, allspice, pepper and cloves in a small bowl. Rub the mixture all over beef.. Heat oil in a large skillet over medium heat. Add the beef and cook until browned, 4 to 5 minutes per side. Transfer to a 5- to 6-quart slow cooker.. Add onion and garlic to the pan. Cook, stirring, for 2 minutes. Add wine and tomatoes (with their juice); bring to a boil, scraping up any browned bits and breaking up the tomatoes. Add the mixture to the slow cooker along with carrots and turnips.. Cover and cook on High for 4 hours or Low for 8 hours.. Remove the beef from the slow cooker and slice. Serve the beef with the sauce and vegetables, garnished with basil, if desired.",
        "link": "https://www.eatingwell.com/recipe/256499/slow-cooker-braised-beef-with-carrots-turnips/"
    },
    {
        "name": "Oven-Baked Salmon with Charred Onions & Old Bay Radishes",
        "calories": "324",
        "carbs": "7",
        "fat": "19",
        "protein": "29",
        "ingredients": "2 medium onions, sliced 1/2 inch thick. 4 tablespoons extra-virgin olive oil, divided. Zest of 2 lemons. 1 ½ teaspoons cracked pepper. 1 teaspoon kosher salt, divided. 4 (5 ounce) skin-on salmon fillets. 6 large radishes, cut into wedges, plus more thinly sliced for garnish. 1 teaspoon Old Bay seasoning. ½ teaspoon sugar. Fresh cilantro & flaky sea salt for garnish",
        "instructions": "Preheat oven to 325 degrees F.. Heat a large cast-iron skillet over high heat. Add onions and cook, pressing down occasionally, until completely charred on one side, 10 to 15 minutes. Turn and cook, pressing down occasionally, until charred on the second side, 8 to 10 minutes more. Transfer to a large bowl and cover tightly. Let steam for 15 minutes.. Meanwhile, mix 2 tablespoons oil, lemon zest, pepper and 1/2 teaspoon salt in a small bowl. Add 1 tablespoon oil to a medium ovenproof nonstick or cast-iron skillet and add salmon, skin-side down. Spread the lemon zest mixture on the salmon. Bake until just cooked through, 14 to 16 minutes.. Bring a small saucepan of water to a boil. Add radish wedges and cook until just tender, 5 to 6 minutes. Drain and pat dry. Dry the pan and add the remaining 1 tablespoon oil and Old Bay. Heat over medium heat until sizzling, about 1 minute. Remove from heat and stir in the radish wedges. Cover and keep warm.. Combine the onions, the remaining 1/2 teaspoon salt and sugar in a food processor; puree until smooth.. Serve the salmon with the onion puree and radishes. Garnish with sliced radishes, cilantro and flaky salt, if desired.",
        "link": "https://www.eatingwell.com/recipe/275794/oven-baked-salmon-with-charred-onions-old-bay-radishes/"
    },
    {
        "name": "Spicy Slow-Cooker Chicken with Lime, Basil & Mint",
        "calories": "157",
        "carbs": "8",
        "fat": "3",
        "protein": "24",
        "ingredients": "3 cups low-sodium chicken broth. 3  shallots, very thinly sliced. ¼ cup fish sauce (see Tips). 2 tablespoons packed light brown sugar. 2-4 Thai chiles, very thinly sliced, or 1 teaspoon crushed red pepper. 2 teaspoons lime zest. 4 pounds skin-on, bone-in chicken breasts. 2 cups julienned or grated carrots. ½ cup lime juice. ⅓ cup sliced fresh mint. ⅓ cup sliced fresh basil",
        "instructions": "Combine broth, shallots, fish sauce, brown sugar, chiles (or crushed red pepper) and lime zest in a 6-quart slow cooker. Nestle chicken meat-side down in the broth. Cook on High for 3 hours or Low for 6 hours.. Remove the chicken to a clean cutting board. Discard the skin and shred the meat. Return the chicken to the slow cooker and stir in carrots, lime juice, mint and basil.",
        "link": "https://www.eatingwell.com/recipe/258518/spicy-slow-cooker-chicken-with-lime-basil-mint/"
    },
    {
        "name": "Ginger-Orange Chicken Thighs with Baby Bok Choy",
        "calories": "299",
        "carbs": "18",
        "fat": "11",
        "protein": "30",
        "ingredients": "2 pounds bone-in chicken thighs. ½ teaspoon Chinese five-spice powder. ¼ teaspoon salt. 2 teaspoons peanut oil. 1 ½ pounds baby bok choy, halved. 1 (11 ounce) can mandarin oranges in light syrup, drained. 2 tablespoons reduced-sodium tamari. 2 tablespoons Shaoxing rice wine or dry sherry, divided. 2 tablespoons minced shallot. 1 tablespoon grated garlic. 1 tablespoon grated fresh ginger. 1 ½ teaspoons cornstarch",
        "instructions": "Preheat oven to 450 degrees F.. Pat chicken dry and sprinkle with five-spice powder and salt. Heat oil in a large cast-iron or other ovenproof skillet over medium heat. Add the chicken, skin-side down, and cook until the skin is golden brown, 6 to 8 minutes. Turn the chicken over and nestle bok choy into the pan.. Transfer to the pan to the oven. Roast until an instant-read thermometer inserted in a thigh without touching bone registers 165 degrees F, about 15 minutes.. Meanwhile, add 1/4 cup syrup from mandarin oranges to a small saucepan. (Drain the remaining syrup and reserve the oranges.) Add tamari, 1 tablespoon rice wine (or sherry), shallot, garlic and ginger to the pan. Bring to a simmer over medium heat and cook for 3 minutes. Whisk the remaining 1 tablespoon rice wine (or sherry) and cornstarch in a small bowl until smooth then whisk it into the sauce. Cook, stirring, until the sauce is thickened, about 1 minute. Strain the sauce into a heatproof measuring cup or bowl and stir in the reserved oranges.. Serve the chicken and bok choy topped with the sauce.",
        "link": "https://www.eatingwell.com/recipe/278546/ginger-orange-chicken-thighs-with-baby-bok-choy/"
    },
    {
        "name": "Creamy Skillet Ranch Chicken & Broccoli",
        "calories": "374",
        "carbs": "6",
        "fat": "26",
        "protein": "29",
        "ingredients": "1 pound boneless, skinless chicken breast, trimmed and cut into bite-size pieces. ½ teaspoon salt, divided. ½ teaspoon ground pepper, divided, plus more for garnish. 2 tablespoons extra-virgin olive oil, divided. 4 cups bite-size broccoli florets. 2 tablespoons water. ½ cup heavy cream. 2 tablespoons white-wine vinegar. 2 tablespoons mayonnaise. 1 teaspoon cornstarch. ½ teaspoon onion powder. ½ teaspoon garlic powder. ¼ cup chopped mixed fresh herbs (chives, dill, tarragon, basil)",
        "instructions": "Sprinkle chicken with 1/4 teaspoon each salt and pepper.. Heat 1 tablespoon oil in a large skillet over medium heat. Add the chicken and cook, stirring occasionally, until browned and just cooked through, 5 to 7 minutes. Transfer to a plate.. Add the remaining 1 tablespoon oil, broccoli and water to the pan. Cover and cook, stirring occasionally, until tender-crisp, 3 to 4 minutes. Transfer to the plate with the chicken.. Whisk cream, vinegar, mayonnaise, cornstarch, onion powder, garlic powder and the remaining 1/4 teaspoon each salt and pepper in a measuring cup. Increase heat to medium-high and pour the cream mixture into the pan. Bring to a simmer and cook, stirring, until thickened, about 2 minutes. Return the chicken and broccoli to the pan and sprinkle with herbs; cook, stirring, until heated through, 1 to 2 minutes more. Garnish with pepper, if desired.",
        "link": "https://www.eatingwell.com/recipe/7961867/creamy-skillet-ranch-chicken-broccoli/"
    },
    {
        "name": "Creamy Chicken, Brussels Sprouts & Mushrooms One-Pot Pasta",
        "calories": "353",
        "carbs": "42",
        "fat": "10",
        "protein": "27",
        "ingredients": "8 ounces whole-wheat linguine or spaghetti. 1 pound boneless, skinless chicken thighs. 4 cups sliced mushrooms. 2 cups sliced Brussels sprouts. 1 medium onion, chopped. 4 cloves garlic, thinly sliced. 2 tablespoons Boursin cheese. 1 ¼ teaspoons dried thyme. ¾ teaspoon dried rosemary. ¾ teaspoon salt. 4 cups water. 2 tablespoons chopped fresh chives",
        "instructions": "Combine pasta, chicken, mushrooms, Brussels sprouts, onion, garlic, Boursin cheese, thyme, rosemary and salt in a large pot. Stir in water. Bring to a boil over high heat. Boil, stirring frequently, until the pasta is cooked and the water has almost evaporated, 10 to 12 minutes. Remove from heat and let stand, stirring occasionally, for 5 minutes. Serve sprinkled with chives.   Photography / Kelsey Hansen, Styling / Sammy Mila",
        "link": "https://www.eatingwell.com/recipe/257110/creamy-chicken-brussels-sprouts-mushrooms-one-pot-pasta/"
    }
]
